// функция принимает параметры и возвращает объект с ошибками,
// если есть ошибки, то операция проводить нельзя
// Пример 
// const output = {
//   errors: [{
//     name: '',
//     message: ''
//   }]
// };

function calcPermission(params) {
  // НТХКС - Наличные, Терминал, Халва, Кредиты, Сертификаты

  // Бонусы и обмен нельзя
  // Бонусы и рассрочка нельзя
  // Бонусы и купоны нельзя
  // Бонусы и прокачка нельзя
  // Бонусы и акционные изделия нельзя
  // Купоны и обмен нельзя
  // Купоны и рассрочка нельзя
  // Прокачка и купоны нельзя
  // Акционные изделиaя и купоны нельзя
}


